In [1]:
import mysql.connector as sql
import pandas as pd

In [2]:
db_connection = sql.connect(host='localhost', database='dbtest1', user='root', password='')
db_cursor = db_connection.cursor()

In [3]:
query = 'SELECT * FROM user'
db_cursor.execute(query)
table_rows = db_cursor.fetchall()

In [4]:
df = pd.DataFrame(table_rows)
df

   0         1     2     3
0  1  user1234  1234  user
1  2  user5678  5678  user

In [5]:
col_names = []
for i in db_cursor.description:
    col_names.append(i[0])
col_names

['id', 'username', 'password', 'role']

In [6]:
df.columns = col_names

In [7]:
df.set_index('id', inplace=True)

In [8]:
df

    username password  role
id
1   user1234     1234  user
2   user5678     5678  user